; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	image1 - mode
	spectrograph0 - mode
	Star4 - direction
	Star7 - direction
	GroundStation8 - direction
	Star9 - direction
	GroundStation5 - direction
	Star0 - direction
	GroundStation6 - direction
	Star2 - direction
	Star3 - direction
	Star1 - direction
	Planet10 - direction
	Planet11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Phenomenon15 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star1)
	(calibration_target instrument0 GroundStation5)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 Star2)
	(supports instrument2 spectrograph0)
	(supports instrument2 image1)
	(calibration_target instrument2 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument3 spectrograph0)
	(supports instrument3 image1)
	(calibration_target instrument3 Star0)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
	(supports instrument4 image1)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 GroundStation6)
	(supports instrument5 image1)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 Star3)
	(calibration_target instrument5 Star2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star3)
	(supports instrument6 image1)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 Star1)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet10)
)
(:goal (and
	(pointing satellite0 GroundStation8)
	(pointing satellite2 Star2)
	(have_image Planet10 image1)
	(have_image Planet11 spectrograph0)
	(have_image Planet12 image1)
	(have_image Phenomenon13 spectrograph0)
	(have_image Planet14 spectrograph0)
	(have_image Phenomenon15 image1)
))

)

; plan
1. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 8
2. (calibrate satellite2 instrument5 star3)
   added: (calibrated instrument5)
   goals met: 0 of 8
3. (turn_to satellite2 planet10 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 planet10)
   goals met: 0 of 8
4. (take_image satellite2 planet10 instrument5 image1)
   added: (have_image planet10 image1)
   goals met: 1 of 8
5. (turn_to satellite2 phenomenon15 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 phenomenon15)
   goals met: 1 of 8
6. (take_image satellite2 phenomenon15 instrument5 image1)
   added: (have_image phenomenon15 image1)
   goals met: 2 of 8
7. (turn_to satellite2 phenomenon13 phenomenon15)
   deleted: (pointing satellite2 phenomenon15)
   added: (pointing satellite2 phenomenon13)
   goals met: 2 of 8
8. (take_image satellite2 phenomenon13 instrument5 spectrograph0)
   added: (have_image phenomenon13 spectrograph0)
   goals met: 3 of 8
9. (turn_to satellite0 groundstation8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 groundstation8)
   goals met: 4 of 8
10. (turn_to satellite2 planet11 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 planet11)
   goals met: 4 of 8
11. (take_image satellite2 planet11 instrument5 spectrograph0)
   added: (have_image planet11 spectrograph0)
   goals met: 5 of 8
12. (turn_to satellite2 planet12 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 planet12)
   goals met: 5 of 8
13. (take_image satellite2 planet12 instrument5 image1)
   added: (have_image planet12 image1)
   goals met: 6 of 8
14. (turn_to satellite2 planet14 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 planet14)
   goals met: 6 of 8
15. (take_image satellite2 planet14 instrument5 spectrograph0)
   added: (have_image planet14 spectrograph0)
   goals met: 7 of 8
16. (turn_to satellite2 star2 planet14)
   deleted: (pointing satellite2 planet14)
   added: (pointing satellite2 star2)
   goals met: 8 of 8
